# Built-in Methods
# هتلاقي هنا افضل والاكثر استخداما من الفنكشن الجاهزه في اللغه
import copy

# globals()["variables"] = 500  # إنشاء متغير عام ديناميكياً بدون كتابة اسمه مباشرة
variables = [5]
print(id(variables))  # id  هي فنكشن بتجيب عنوان المتغير من المومري
print(
    dir(variables)
)  # دي بتعرفك كل الفنكشن المتاحه للعمل علي قيمه المتغير ده وهتلاقي كتير جدا
print(
    f"{variables[0].__add__(3)}"
)  # مجرد متكتب اسم المتغير وبعده دووت هيظهر كل الفنكشن دي
print(type(variables))  # بتعرفني نوع الداتا تايب ايه
variables.append(4)
print(variables)  # مسؤوله عن اضافه قيم لليست
variables1 = copy.deepcopy(
    variables
)  # فنكشن بمكتبه شامله لنسخ الليست بالكامل وانشاء مكان ليها في الذاكره
variables2 = (
    variables.copy()
)  # الفرق بين دي والي فوق ان الي فوق بتعمل اوبجكت جديد نسخ كامل لو غيرت واحده فيهم التانيه متتاسرش
# لاكن التانيه بتاخد المتغير الجديد لنفس مكان الاوبجكت شراكه يعني
