def y():
    r = 9 + 9
    print(r)  # دي داله عاديه وظيفتها هتطبع قيمه معينه فقط


e = (
    y()
)  # بايثون بتشغل الداله وتشوف بتعمل ايه وتنفزه وبعد كده بتساوي الاوت بوت بامتغير الجديد
print(e)


def add_with_print(a, b):
    print(a + b)  # يطبع فقط


def add_with_return(a, b):
    return a + b  # يرجع القيمة لاستخدامها


# تجربة:
x = add_with_print(2, 3)  # يطبع 5، لكن المتغير x قيمته لا شيء (None)
y = add_with_return(2, 3)  # لا يطبع شيء، لكن المتغير y أصبح قيمته 5!

print(y * 10)  # يطبع 50 (لأننا استطعنا استخدام y)
print(x + 1)
