# 1. الأساسيات
print(int(5.7))
print(float(10))
print(str(100))

# 2. أوعية البيانات
my_tuple = (1, 2, 2, 3)
print(list(my_tuple))
print(set(my_tuple))
print(tuple([5, 6]))

# بالنسبة للقاموس لازم تديله أزواج جاهزة
pairs = [("name", "Ali"), ("age", 19)]  # خد لالك متنساش الاقواس هنا
print(dict(pairs))  # ينفع احول اوعيه البيانات عدي السترينج ل دكت

# 3. الأنظمة والرموز
print(ord("A"))  # الناتج: 65
print(hex(15))  # الناتج: '0xf'
print(oct(8))  # الناتج: '0o10'


# الكاستنج بيغير القيمه مؤقتا بس القيمه الاصليه بتفضل زي ما هي
# بطريقه تانيه الكاستنج بيغير الداتا تايب في السطر الي هو فيه فقط
w, h = 7, 9
str(w)
str(h)  # مع ان حولناهم استرينج طبه مجموعهم عادي
print(w + h)


a = isinstance("صص", str)
print(a)
