list = [2, 9, 9, 3]
list1 = ["a", 4, True, 44.99]
list2 = [5, 3, 1, [6, 3], 5]


print(list[0])  # طباعه عنصر جوه الليست
print(list, sep=" ")
print(*list)  # طباعه الليست كعناصر عاديه بدون الاقواس والفواصل
print(list[1:3])  # هيطبع من الاندكس واحد لحد ما قبل الاندكس 3
print(
    list[:3:1]
)  # هنا بقوله هتطبع من الندكس 0 لحد 3 عنصر ورا عنصر ولو غيرت ال1 ل 2 هيطبع عنصر ويسيب عنصر
print(list2[3][0:3])

list.insert(len(list), 6)  # ايضافه عناصر لليست
list.append(
    list2
)  # اضافه عنصر لليست وعندي ايضافه ليست الي ليست تصبح الثانيه كعنصر من الاولي
print(list[5][3][0])  # الوصول لعنصر معين بداخل ليست جزئيه من اخري
list.extend([9, 6, 4])  # اضافه عناصر لليست بدل ايضافها كليست اخري


list.remove(list[2])  # حذف جزء معين
print(list)
list3 = [2, 3, 6, 7, 8, 9, 6, 0]
list3.sort(
    reverse=False
)  # لازم تكون الليست استرنج او ارقام فقط. لو ترو هطبع من الكبير للصغير
print(list3)
list3.reverse()  # بتشقلب الليست بس
print(list3)

